//javaScript課題①-1
// for (let i = 1; i < 100; i++) {
//   if (i % 3 === 0 && i % 5 === 0) {
//     console.log('FizzBuzz', i);
//   } else if (i % 3 === 0) {
//     console.log('Fizz', i);
//   } else if (i % 5 === 0) {
//     console.log('Buzz', i);
//   }
// }
//----------------------------------------------------------------------------------------------------------------------------

//javaScript課題①-2

let answer = "";

while (answer !== "東京") {
  answer = prompt("日本の首都は？");
  if (answer === "東京") {
    alert("正解です！");
  } else {
    alert("不正解です！");
  }
}

//----------------------------------------------------------------------------------------------------------------------------
